Revit 2026 API

# SelectionFilterElementAddSet Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddSet(
	ICollection<ElementId> ids
)
```
```vb
Public Sub AddSet (
	ids As ICollection(Of ElementId)
)
```
```cpp
public:
void AddSet(
	ICollection<ElementId^>^ ids
)
```
```fsharp
member AddSet :
        ids : ICollection<ElementId> -> unit
```

#### Parameters

ids ICollectionElementId

#### Reference

SelectionFilterElement Class

Autodesk.Revit.DB Namespace